// Define the image paths and corresponding labels
const images = {
    alef:  ['alef_01.png' , 'alef_02.png' , 'alef_03.png' , 'alef_04.png' , 'alef_05.png' , 'alef_06.png' , 'alef_07.png' , 'alef_08.png' , 'alef_09.png' , 'alef_10.png'],
    beit:  ['beit_01.png' , 'beit_02.png' , 'beit_03.png' , 'beit_04.png' , 'beit_05.png' , 'beit_06.png' , 'beit_07.png' , 'beit_08.png' , 'beit_09.png' , 'beit_10.png'],
    gimel: ['gimel_01.png', 'gimel_02.png', 'gimel_03.png', 'gimel_04.png', 'gimel_05.png', 'gimel_06.png', 'gimel_07.png', 'gimel_08.png', 'gimel_09.png', 'gimel_10.png'],
    lamed: ['lamed_01.png', 'lamed_02.png', 'lamed_03.png', 'lamed_04.png', 'lamed_05.png', 'lamed_06.png', 'lamed_07.png', 'lamed_08.png', 'lamed_09.png', 'lamed_10.png'],
    zadi:  ['zadi_01.png' , 'zadi_02.png' , 'zadi_03.png' , 'zadi_04.png' , 'zadi_05.png' , 'zadi_06.png' , 'zadi_07.png' , 'zadi_08.png' , 'zadi_09.png' , 'zadi_10.png'],
    // future
    // shin:  ['alef_01.png' , 'alef_02.png' , 'alef_03.png' , 'alef_04.png' , 'alef_05.png' , 'alef_06.png' , 'alef_07.png' , 'alef_08.png' , 'alef_09.png' , 'alef_10.png'],
};

// Corresponding labels for each image;
const labels = {
    alef: [
        `
        01
        מגילות מדבר יהודה
        מאה 1 לפנה״ס
        כתב יהודי
        `,
        `
        02
        מגילות מדבר יהודה
        מאה 1 לפנה״ס
        כתב יהודי
        `,
        `
        03
        איסוף כתבי יד ילדים
        היום
        בסגנון ״כתב דפוס״ מרובע
        `,
        `
        04
        כתב יד מוילאלון
        מאה 15
        ספרדי בינוני
        `,
        `
        05
        לוי בן גרשום: פרוש כתובים לרלב"ג, פארמה איטליה
        מאה 15
        ספרדי בינוני
        `,
        `
        06
        הכתב הפיניקי
        מאה 10 לפנה״ס
        `,
        `
        07
        כתב יד מפארמה איטליה
        מאה 15
        אשכנזי רהוט
        `,
        `
        08
        איסוף כתבי יד ילדים
        היום
        בסגנון ״כתב יד״ רהוט
        `,
        `
        09
        גופן פלוני יד,
        אאא - פלוני־יד נוצר מהכלאה של כתב־יד עם כתב דפוס
        2018
        ישראלי רהוט
        `,
        `
        10
        הנחיות לכתיבה תמה
        ״אות הכתב ואות הדפוס״
        ד״ר צבי רדי
        1977
        ישראלי רהוט
        `,
    ],
    beit: [
        `
        01
        ראשית כתיבה ילדים
        היום
        בסגנון ״כתב דפוס״ מרובע
        `,
        `
        02
        כתב יד מפאס, מרוקו
        מאה 14
        ספרדי בינוני
        `,
        `
        03
        כתב יד מוילאלון
        מאה 15
        ספרדי בינוני
        `,
        `
        04
        כתב יד מפארמה איטליה
        מאה 15
        אשכנזי רהוט
        `,
        `
        05
        כתב ארמי
        מאה 3 לפנה״ס
        `,
        `
        06
        איגרת יהודה הלוי
        מאה 11
        ספרדי רהוט
        `,
        `
        07
        משה סופר, פרשבורג הונגריה
        מאה 19
        אשכנזי רהוט
        `,
        `
        08
        ר׳ אליה גוטמאכר פולין
        1867
        אשכנזי רהוט
        `,
        `
        09
        הנחיות לכתיבה תמה
        ״אות הכתב ואות הדפוס״, ד״ר צבי רדי
        1977
        ישראלי רהוט
        `,
        `
        10
        ״רולי בזק״
        רוטשילד-ליפמן, קטלוג לטרסט ארטא
        שנות ה70-80
        ישראלי רהוט
        `,
    ],
    gimel: [
        `
        01
        איסוף כתבי יד ילדים
        היום
        סגנון ״בינוני״
        `,
        `
        02
        כתב יד מינכן של התלמוד (ספר הכתב העברי)
        שנת 1343 (מאה 14)
        כתב אשכנזי גותי
        `,
        `
        03
        כתב יד מפאס, מרוקו
        מאה 14
        ספרדי בינוני
        `,
        `
        04
        כתב יד מפארמה איטליה
        מאה 15
        אשכנזי רהוט
        `,
        `
        05
        מכתב מאת א׳ חיים הלוי סולוביצקי- פולין
        מאה 18-20  (לא ידוע)
        אשכנזי רהוט
        `,
        `
        06
        הגהות על התנ"ך: פרושים קצרים בחלקם דקדוקיים
        אברהם בן מרדכי (הספריה הלאומית)
        מאה 18-19
        אשכנזית - קראית
        `,
        `
        07
        מכתב מאת א׳ חיים הלוי סולוביצקי- פולין
        מאה 18-20  (לא ידוע)
        אשכנזי רהוט
        `,
        `
        08
        ״מחברת לכתיבה תמה״, ר. בן עמי (הספריה הלאומית)
        1960
        ישראלי רהוט
        `,
        `
        09
        ״קורסיבה״, מתוך ״כתב אמנותי עברי״ ל.פ. טובי ורוטישלד - ליפמן
        1951
        ישראלי רהוט
        `,
        `
        10
        גופן פלוני יד,
        אאא - פלוני־יד נוצר מהכלאה של כתב־יד עם כתב דפוס
        2018
        ישראלי רהוט
        `,
    ],
    lamed: [
        `
        01
        איסוף כתבי יד ילדים
        היום
        בסגנון ״כתב דפוס״ מרובע
        `,
        `
        02
        ״מאיר דן״
        קטלוג אותיות לטרסט ארטא
        שנות ה-80 (משוער)
        סגנון בינוני
        `,
        `
        03
        כתב יד מפאס, מרוקו
        מאה 14
        ספרדי בינוני
        `,
        `
        04
        כתב יד מוילאלון
        מאה 15
        ספרדי בינוני
        `,
        `
        05
        כתובות עבריות על ארונות קבורה מבית שערים ומיפו
        מאה 3-4 לפנה״ס
        כתב עברי
        `,
        `
        06
        מגילות מדבר יהודה
        מאה 1-2 לפנה״ס
        כתב עברי
        `,
        `
        07
        איגרת יהודה הלוי
        מאה 11
        ספרדי רהוט
        `,
        `
        08
        כתב יד מפארמה איטליה
        מאה 15
        אשכנזי רהוט
        `,
        `
        09
        כרזה: ״נדאג לשניהם״ האחים שמיר
        ליתוגרפיה
        1959
        סגנון כתב יד ישראלי
        `,
        `
        10
        גופן כוס חלב, דני מירב - הטייס (הגילדה)
        2003
        שילוב של אותיות דפוס לכתב,
        בסגנון ״כתב יד״
        `,
    ],
    zadi: [
        `
        01
        פשר חבקוק, מגילות מדבר יהודה
        מאה 1-2 לפנה״ס
        כתב עברי הרודיאני
        `,
        `
        02
        איסוף כתבי יד מבוגרים
        2019
        סגנון ״דפוס״ בינוני
        `,
        `
        03
        כתב יד מוילאלון
        מאה 15
        ספרדי בינוני
        `,
        `
        04
        כתב יד מטולדו
        מאה 14
        ספרדי בינוני
        `,
        `
        05
        כתב ר׳ בנימין ר״ב מאיר הלוי אשכנזי, סלוניקי
        מאה 16
        ספרדי רהוט
        `,
        `
        06
        קלעת איוב
        מאה 15
        ספרדי רהוט
        `,
        `
        07
        כתב יד מאיטליה
        מאה 15
        אשכנזי בינוני
        `,
        `
        08
        כתב יד מפארמה איטליה
        מאה 15
        אשכנזי רהוט
        `,
        `
        09
        ״רולי בזק״
        רוטשילד-ליפמן, קטלוג לטרסט ארטא
        שנות ה70-80
        ישראלי רהוט
        `,
        `
        10
        איסוף כתבי יד ילדים
        2019
        בסגנון ״כתב יד״
        `,
    ],
    // shin: [
        // future Add shin text content here
    // ],
};
