// Define the image paths and corresponding labels
const images = {
    alef:  ['alef_demo.png', 'alef_demo.png', 'alef_demo.png', 'alef_demo.png', 'alef_demo.png', 'alef_demo.png', 'alef_demo.png', 'alef_demo.png', 'alef_demo.png', 'alef_demo.png'],
    beit:  ['alef_demo.png', 'alef_demo.png', 'alef_demo.png', 'alef_demo.png', 'alef_demo.png', 'alef_demo.png', 'alef_demo.png', 'alef_demo.png', 'alef_demo.png', 'alef_demo.png'],
    gimel: ['alef_demo.png', 'alef_demo.png', 'alef_demo.png', 'alef_demo.png', 'alef_demo.png', 'alef_demo.png', 'alef_demo.png', 'alef_demo.png', 'alef_demo.png', 'alef_demo.png'],
    lamed: ['alef_demo.png', 'alef_demo.png', 'alef_demo.png', 'alef_demo.png', 'alef_demo.png', 'alef_demo.png', 'alef_demo.png', 'alef_demo.png', 'alef_demo.png', 'alef_demo.png'],
    zadi:  ['alef_demo.png', 'alef_demo.png', 'alef_demo.png', 'alef_demo.png', 'alef_demo.png', 'alef_demo.png', 'alef_demo.png', 'alef_demo.png', 'alef_demo.png', 'alef_demo.png'],
    shin:  ['alef_demo.png', 'alef_demo.png', 'alef_demo.png', 'alef_demo.png', 'alef_demo.png', 'alef_demo.png', 'alef_demo.png', 'alef_demo.png', 'alef_demo.png', 'alef_demo.png'],
    // TODO change the image paths to the actual images
    // alef: ['alef_1.png', 'alef_2.png', 'alef_3.png', 'alef_4.png', 'alef_5.png', 'alef_6.png', 'alef_7.png', 'alef_8.png', 'alef_9.png', 'alef_10.png'],
};

// Corresponding labels for each image;
const labels = {
    alef: [
        `
        01
        מגילות מדבר יהודה
        מאה 1 לפנה״ס
        כתב יהודי
        `,
        `
        02
        מגילות מדבר יהודה
        מאה 1 לפנה״ס
        כתב יהודי
        `,
        `
        03
        איסוף כתבי יד ילדים
        היום
        בסגנון ״כתב דפוס״ מרובע
        `,
        `
        04
        כתב יד מוילאלון
        מאה 15
        ספרדי בינוני
        `,
        `
        05
        לוי בן גרשום: פרוש כתובים לרלב"ג, פארמה איטליה
        מאה 15
        ספרדי בינוני
        `,
        `
        06
        הכתב הפיניקי
        מאה 10 לפנה״ס
        `,
        `
        07
        כתב יד מפארמה איטליה
        מאה 15
        אשכנזי רהוט
        `,
        `
        08
        איסוף כתבי יד ילדים
        היום
        בסגנון ״כתב יד״ רהוט
        `,
        `
        09
        גופן פלוני יד,
        אאא - פלוני־יד נוצר מהכלאה של כתב־יד עם כתב דפוס
        2018
        ישראלי רהוט
        `,
        `
        10
        הנחיות לכתיבה תמה
        ״אות הכתב ואות הדפוס״
        ד״ר צבי רדי
        1977
        ישראלי רהוט
        `,
    ],
    beit: [
        `
        01
        ראשית כתיבה ילדים
        היום
        בסגנון ״כתב דפוס״ מרובע
        `,
        `
        02
        כתב יד מפאס, מרוקו
        מאה 14
        ספרדי בינוני
        `,
        `
        03
        כתב יד מוילאלון
        מאה 15
        ספרדי בינוני
        `,
        `
        04
        כתב יד מפארמה איטליה
        מאה 15
        אשכנזי רהוט
        `,
        `
        05
        כתב ארמי
        מאה 3 לפנה״ס
        `,
        `
        06
        איגרת יהודה הלוי
        מאה 11
        ספרדי רהוט
        `,
        `
        07
        משה סופר, פרשבורג הונגריה
        מאה 19
        אשכנזי רהוט
        `,
        `
        08
        ר׳ אליה גוטמאכר פולין
        1867
        אשכנזי רהוט
        `,
        `
        09
        הנחיות לכתיבה תמה
        ״אות הכתב ואות הדפוס״, ד״ר צבי רדי
        1977
        ישראלי רהוט
        `,
        `
        10
        ״רולי בזק״
        רוטשילד-ליפמן, קטלוג לטרסט ארטא
        שנות ה70-80
        ישראלי רהוט
        `,
    ],
    gimel: [
        `
        01
        איסוף כתבי יד ילדים
        היום
        סגנון ״בינוני״
        `,
        `
        02
        כתב יד מינכן של התלמוד (ספר הכתב העברי)
        שנת 1343 (מאה 14)
        כתב אשכנזי גותי
        `,
        `
        03
        כתב יד מפאס, מרוקו
        מאה 14
        ספרדי בינוני
        `,
        `
        04
        כתב יד מפארמה איטליה
        מאה 15
        אשכנזי רהוט
        `,
        `
        05
        מכתב מאת א׳ חיים הלוי סולוביצקי- פולין
        מאה 18-20  (לא ידוע)
        אשכנזי רהוט
        `,
        `
        06
        הגהות על התנ"ך: פרושים קצרים בחלקם דקדוקיים
        אברהם בן מרדכי (הספריה הלאומית)
        מאה 18-19
        אשכנזית - קראית
        `,
        `
        07
        מכתב מאת א׳ חיים הלוי סולוביצקי- פולין
        מאה 18-20  (לא ידוע)
        אשכנזי רהוט
        `,
        `
        08
        ״מחברת לכתיבה תמה״, ר. בן עמי (הספריה הלאומית)
        1960
        ישראלי רהוט
        `,
        `
        09
        ״קורסיבה״, מתוך ״כתב אמנותי עברי״ ל.פ. טובי ורוטישלד - ליפמן
        1951
        ישראלי רהוט
        `,
        `
        10
        גופן פלוני יד,
        אאא - פלוני־יד נוצר מהכלאה של כתב־יד עם כתב דפוס
        2018
        ישראלי רהוט
        `,
    ],
    lamed: [
        `
        01
        איסוף כתבי יד ילדים
        היום
        בסגנון ״כתב דפוס״ מרובע
        `,
        `
        02
        ״מאיר דן״
        קטלוג אותיות לטרסט ארטא
        שנות ה-80 (משוער)
        סגנון בינוני
        `,
        `
        03
        כתב יד מפאס, מרוקו
        מאה 14
        ספרדי בינוני
        `,
        `
        04
        כתב יד מוילאלון
        מאה 15
        ספרדי בינוני
        `,
        `
        05
        כתובות עבריות על ארונות קבורה מבית שערים ומיפו
        מאה 3-4 לפנה״ס
        כתב עברי
        `,
        `
        06
        מגילות מדבר יהודה
        מאה 1-2 לפנה״ס
        כתב עברי
        `,
        `
        07
        איגרת יהודה הלוי
        מאה 11
        ספרדי רהוט
        `,
        `
        08
        כתב יד מפארמה איטליה
        מאה 15
        אשכנזי רהוט
        `,
        `
        09
        כרזה: ״נדאג לשניהם״ האחים שמיר
        ליתוגרפיה
        1959
        סגנון כתב יד ישראלי
        `,
        `
        10
        גופן כוס חלב, דני מירב - הטייס (הגילדה)
        2003
        שילוב של אותיות דפוס לכתב,
        בסגנון ״כתב יד״
        `,
    ],
    zadi: [
        `
        01
        פשר חבקוק, מגילות מדבר יהודה
        מאה 1-2 לפנה״ס
        כתב עברי הרודיאני
        `,
        `
        02
        איסוף כתבי יד מבוגרים
        2019
        סגנון ״דפוס״ בינוני
        `,
        `
        03
        כתב יד מוילאלון
        מאה 15
        ספרדי בינוני
        `,
        `
        04
        כתב יד מטולדו
        מאה 14
        ספרדי בינוני
        `,
        `
        05
        כתב ר׳ בנימין ר״ב מאיר הלוי אשכנזי, סלוניקי
        מאה 16
        ספרדי רהוט
        `,
        `
        06
        קלעת איוב
        מאה 15
        ספרדי רהוט
        `,
        `
        07
        כתב יד מאיטליה
        מאה 15
        אשכנזי בינוני
        `,
        `
        08
        כתב יד מפארמה איטליה
        מאה 15
        אשכנזי רהוט
        `,
        `
        09
        ״רולי בזק״
        רוטשילד-ליפמן, קטלוג לטרסט ארטא
        שנות ה70-80
        ישראלי רהוט
        `,
        `
        10
        איסוף כתבי יד ילדים
        2019
        בסגנון ״כתב יד״
        `,
    ],
    shin: [
        // TODO Add shin text content here
    ],
};
